# ACL Estendida e Firewall Stateful com TCP

## Introdução

O **TCP** pode executar serviços básicos de **firewall stateful** usando a palavra-chave `established`.  
A palavra-chave permite que o tráfego interno **saia** da rede privada interna e permite que o tráfego de resposta **retorne**.  
No entanto, o tráfego TCP **gerado por um host externo** tentando se comunicar com um host interno **é negado**.  

A palavra-chave `established` pode ser usada para permitir **apenas** o tráfego **HTTP de retorno** de sites solicitados, negando todo o outro tráfego.  

---

## ACLs Configuradas

Na topologia, a configuração envolve **duas ACLs**:

1. **ACL 110** → Filtra o tráfego **saindo** da rede privada interna.
2. **ACL 120** → Usa `established` para filtrar o tráfego **que entra** na rede privada.

A **ACL 120** é aplicada **de saída** na interface `R1 G0/0/0`.  

---

## Configuração da ACL 120

```bash
    R1(config)# access-list 120 permit tcp any 192.168.10.0 0.0.0.255 established
    R1(config)# interface g0/0/0
    R1(config-if)# ip access-group 120 out
    R1(config-if)# end
```

---

## Verificação das ACLs

```bash
    R1# show access-lists
    Extended IP access list 110
        10 permit tcp 192.168.10.0 0.0.0.255 any eq www
        20 permit tcp 192.168.10.0 0.0.0.255 any eq 443 (657 matches)
    Extended IP access list 120
        10 permit tcp any 192.168.10.0 0.0.0.255 established (1166 matches)
    R1#
```

`
    Nota: Os contadores HTTPS seguros (eq 443) na ACL 110 e os contadores estabelecidos de retorno na ACL 120 aumentaram.
`

---

## 📌 Funcionamento do Parâmetro _established_

O parâmetro **_established_** permite somente as respostas ao tráfego originado da rede **192.168.10.0/24**.

### 🔹 Critério de correspondência:
- ✅ O segmento TCP de retorno deve conter os bits de sinalizador **ACK** ou **RST**.
  - Isso indica que o pacote pertence a uma conexão existente.

### 🔻 Sem o parâmetro _established_:
- ❌ Clientes poderiam enviar tráfego para um servidor Web.
- ❌ O servidor Web responderia normalmente.
- ❌ Todo o tráfego seria permitido.

---

## ACL IPv4 Estendida Nomeada

Criar uma ACL nomeada facilita a compreensão de sua função.

Sintaxe:
```bash
    Router(config)# ip access-list extended <nome-da-acl>
```

- Os nomes das ACLs:
    - Devem ser únicos.
    - Diferenciam maiúsculas e minúsculas.
    - Podem ser alfanuméricos.

### Exemplo: Criando a ACL NO-FTP-ACCESS

```bash
    R1(config)# ip access-list extended NO-FTP-ACCESS
    R1(config-ext-nacl)#
```

---

## 📌 ACLs Nomeadas: SURFING e BROWSING

A topologia demonstra a aplicação de duas ACLs IPv4 estendidas nomeadas:

- 🔹 SURFING → ✅ Permite tráfego HTTP e HTTPS sair para a Internet.
- 🔹 BROWSING → ✅ Permite apenas o tráfego da Web de retorno.

| **ACL**      | **Direção** | **Função**                                      |
|-------------|------------|------------------------------------------------|
| 🔹 _SURFING_  | 📥 Entrada  | ✅ Permite **HTTP** e **HTTPS** para a Internet |
| 🔹 _BROWSING_ | 📤 Saída    | ✅ Permite somente **tráfego de retorno**       |

---

## Configuração das ACLs Nomeadas

### ACL SURFING (Entrada)

```bash
    R1(config)# ip access-list extended SURFING
    R1(config-ext-nacl)# Remark Permits inside HTTP and HTTPS traffic
    R1(config-ext-nacl)# permit tcp 192.168.10.0 0.0.0.255 any eq 80
    R1(config-ext-nacl)# permit tcp 192.168.10.0 0.0.0.255 any eq 443
    R1(config-ext-nacl)# exit
```

### ACL BROWSING (Saída)

```bash
    R1(config)# ip access-list extended BROWSING
    R1(config-ext-nacl)# Remark Only permit returning HTTP and HTTPS traffic
    R1(config-ext-nacl)# permit tcp any 192.168.10.0 0.0.0.255 established
    R1(config-ext-nacl)# exit
```

### Aplicação na Interface

```bash
    R1(config)# interface g0/0/0
    R1(config-if)# ip access-group SURFING in
    R1(config-if)# ip access-group BROWSING out
    R1(config-if)# end
```

### Verificação das ACLs Nomeadas

```bash
    R1# show access-lists
    Extended IP access list SURFING
    10 permit tcp 192.168.10.0 0.0.0.255 any eq www
    20 permit tcp 192.168.10.0 0.0.0.255 any eq 443 (124 matches)
    Extended IP access list BROWSING
    10 permit tcp any 192.168.10.0 0.0.0.255 established (369 matches)
    R1#
```

---

## Conclusão:

- ✅ O tráfego HTTPS (443) foi permitido de saída.
- ✅ As respostas foram autorizadas para retornar.
- ✅ O número de correspondências aumentou, provando o funcionamento correto.

---

### Resumo
- ✔ A ACL 110 permite tráfego saindo para HTTP e HTTPS.
- ✔ A ACL 120 usa established para permitir somente respostas ao tráfego iniciado internamente.
- ✔ ACLs nomeadas (SURFING e BROWSING) tornam a configuração mais clara e gerenciável.


### 🚀 Benefícios do método:

1. Maior segurança na filtragem de tráfego.
2. Controle refinado do tráfego de entrada e saída.
3. Melhor organização com ACLs nomeadas.
4. Verifique sempre as estatísticas usando show access-lists.