# ACL Estendida e Firewall Stateful com TCP

## IntroduÃ§Ã£o

O **TCP** pode executar serviÃ§os bÃ¡sicos de **firewall stateful** usando a palavra-chave `established`.  
A palavra-chave permite que o trÃ¡fego interno **saia** da rede privada interna e permite que o trÃ¡fego de resposta **retorne**.  
No entanto, o trÃ¡fego TCP **gerado por um host externo** tentando se comunicar com um host interno **Ã© negado**.  

A palavra-chave `established` pode ser usada para permitir **apenas** o trÃ¡fego **HTTP de retorno** de sites solicitados, negando todo o outro trÃ¡fego.  

---

## ACLs Configuradas

Na topologia, a configuraÃ§Ã£o envolve **duas ACLs**:

1. **ACL 110** â†’ Filtra o trÃ¡fego **saindo** da rede privada interna.
2. **ACL 120** â†’ Usa `established` para filtrar o trÃ¡fego **que entra** na rede privada.

A **ACL 120** Ã© aplicada **de saÃ­da** na interface `R1 G0/0/0`.  

---

## ConfiguraÃ§Ã£o da ACL 120

```bash
    R1(config)# access-list 120 permit tcp any 192.168.10.0 0.0.0.255 established
    R1(config)# interface g0/0/0
    R1(config-if)# ip access-group 120 out
    R1(config-if)# end
```

---

## VerificaÃ§Ã£o das ACLs

```bash
    R1# show access-lists
    Extended IP access list 110
        10 permit tcp 192.168.10.0 0.0.0.255 any eq www
        20 permit tcp 192.168.10.0 0.0.0.255 any eq 443 (657 matches)
    Extended IP access list 120
        10 permit tcp any 192.168.10.0 0.0.0.255 established (1166 matches)
    R1#
```

`
    Nota: Os contadores HTTPS seguros (eq 443) na ACL 110 e os contadores estabelecidos de retorno na ACL 120 aumentaram.
`

---

## ğŸ“Œ Funcionamento do ParÃ¢metro _established_

O parÃ¢metro **_established_** permite somente as respostas ao trÃ¡fego originado da rede **192.168.10.0/24**.

### ğŸ”¹ CritÃ©rio de correspondÃªncia:
- âœ… O segmento TCP de retorno deve conter os bits de sinalizador **ACK** ou **RST**.
  - Isso indica que o pacote pertence a uma conexÃ£o existente.

### ğŸ”» Sem o parÃ¢metro _established_:
- âŒ Clientes poderiam enviar trÃ¡fego para um servidor Web.
- âŒ O servidor Web responderia normalmente.
- âŒ Todo o trÃ¡fego seria permitido.

---

## ACL IPv4 Estendida Nomeada

Criar uma ACL nomeada facilita a compreensÃ£o de sua funÃ§Ã£o.

Sintaxe:
```bash
    Router(config)# ip access-list extended <nome-da-acl>
```

- Os nomes das ACLs:
    - Devem ser Ãºnicos.
    - Diferenciam maiÃºsculas e minÃºsculas.
    - Podem ser alfanumÃ©ricos.

### Exemplo: Criando a ACL NO-FTP-ACCESS

```bash
    R1(config)# ip access-list extended NO-FTP-ACCESS
    R1(config-ext-nacl)#
```

---

## ğŸ“Œ ACLs Nomeadas: SURFING e BROWSING

A topologia demonstra a aplicaÃ§Ã£o de duas ACLs IPv4 estendidas nomeadas:

- ğŸ”¹ SURFING â†’ âœ… Permite trÃ¡fego HTTP e HTTPS sair para a Internet.
- ğŸ”¹ BROWSING â†’ âœ… Permite apenas o trÃ¡fego da Web de retorno.

| **ACL**      | **DireÃ§Ã£o** | **FunÃ§Ã£o**                                      |
|-------------|------------|------------------------------------------------|
| ğŸ”¹ _SURFING_  | ğŸ“¥ Entrada  | âœ… Permite **HTTP** e **HTTPS** para a Internet |
| ğŸ”¹ _BROWSING_ | ğŸ“¤ SaÃ­da    | âœ… Permite somente **trÃ¡fego de retorno**       |

---

## ConfiguraÃ§Ã£o das ACLs Nomeadas

### ACL SURFING (Entrada)

```bash
    R1(config)# ip access-list extended SURFING
    R1(config-ext-nacl)# Remark Permits inside HTTP and HTTPS traffic
    R1(config-ext-nacl)# permit tcp 192.168.10.0 0.0.0.255 any eq 80
    R1(config-ext-nacl)# permit tcp 192.168.10.0 0.0.0.255 any eq 443
    R1(config-ext-nacl)# exit
```

### ACL BROWSING (SaÃ­da)

```bash
    R1(config)# ip access-list extended BROWSING
    R1(config-ext-nacl)# Remark Only permit returning HTTP and HTTPS traffic
    R1(config-ext-nacl)# permit tcp any 192.168.10.0 0.0.0.255 established
    R1(config-ext-nacl)# exit
```

### AplicaÃ§Ã£o na Interface

```bash
    R1(config)# interface g0/0/0
    R1(config-if)# ip access-group SURFING in
    R1(config-if)# ip access-group BROWSING out
    R1(config-if)# end
```

### VerificaÃ§Ã£o das ACLs Nomeadas

```bash
    R1# show access-lists
    Extended IP access list SURFING
    10 permit tcp 192.168.10.0 0.0.0.255 any eq www
    20 permit tcp 192.168.10.0 0.0.0.255 any eq 443 (124 matches)
    Extended IP access list BROWSING
    10 permit tcp any 192.168.10.0 0.0.0.255 established (369 matches)
    R1#
```

---

## ConclusÃ£o:

- âœ… O trÃ¡fego HTTPS (443) foi permitido de saÃ­da.
- âœ… As respostas foram autorizadas para retornar.
- âœ… O nÃºmero de correspondÃªncias aumentou, provando o funcionamento correto.

---

### Resumo
- âœ” A ACL 110 permite trÃ¡fego saindo para HTTP e HTTPS.
- âœ” A ACL 120 usa established para permitir somente respostas ao trÃ¡fego iniciado internamente.
- âœ” ACLs nomeadas (SURFING e BROWSING) tornam a configuraÃ§Ã£o mais clara e gerenciÃ¡vel.


### ğŸš€ BenefÃ­cios do mÃ©todo:

1. Maior seguranÃ§a na filtragem de trÃ¡fego.
2. Controle refinado do trÃ¡fego de entrada e saÃ­da.
3. Melhor organizaÃ§Ã£o com ACLs nomeadas.
4. Verifique sempre as estatÃ­sticas usando show access-lists.